In [1]:
import datetime
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline
import matplotlib.pyplot as plt

                      Region Period Begin  Median Ppsf Median Sale Price
0  Chicago, IL - Albany Park    11/1/2011    78.400000             $154K
1  Chicago, IL - Albany Park    12/1/2011    76.800000             $122K
2  Chicago, IL - Albany Park     1/1/2012    77.929915             $129K
3  Chicago, IL - Albany Park     2/1/2012    80.898704             $131K
4  Chicago, IL - Albany Park     3/1/2012    98.397311             $141K